fonecmid-diplom/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <informationRegisterPeriodicity>Nonperiodical</informationRegisterPeriodicity>
  <writeMode>Independent</writeMode>
  <resources>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.ВКМ_Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.ВКМ_Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>false</actionPeriod>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <actionPeriod>false</actionPeriod>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВКМ_Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_ПланОтпусковСотрудников/ВКМ_ПланОтпусковСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ПланОтпусковСотрудников</name>
  <resources>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ДокументОснование</name>
    <type>
      <types>DocumentRef.ВКМ_ГрафикОтпусков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>ВКМ_Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ВКМ_Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/CommonModules/ВКМ_РасчетЗарплаты/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сумму НДФЛ 13% от суммы начисления.
//
// Параметры:
//  СуммаНачисления - Число - сумма, с которой удерживается налог.
//
// Возвращаемое значение:
//  Число - сумма НДФЛ; 0, если начисление не положительное.
//
Функция ВКМ_РассчитатьНДФЛ(СуммаНачисления) Экспорт

	Если СуммаНачисления <= 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Окр(СуммаНачисления * ВКМ_СтавкаНДФЛ(), ВКМ_РазрядностьСуммы());

КонецФункции

// Заполняет график работы пн-пт = 1, сб-вс = 0 на указанный интервал.
//
// Параметры:
//  ДатаНачала - Дата - первый день интервала графика.
//  ДатаОкончания - Дата - последний день интервала графика.
//
Процедура ВКМ_ОбеспечитьГрафикРаботы(ДатаНачала, ДатаОкончания) Экспорт

	Если НЕ ЗначениеЗаполнено(ДатаНачала) Или НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	График.ВКМ_Дата КАК ВКМ_Дата
	|ИЗ
	|	РегистрСведений.ВКМ_ГрафикиРаботы КАК График
	|ГДЕ
	|	График.ВКМ_Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(ДатаОкончания));

	СуществующиеДаты = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СуществующиеДаты.Вставить(НачалоДня(Выборка.ВКМ_Дата), Истина);
	КонецЦикла;

	НаборЗаписей = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	ТекущаяДатаГрафика = НачалоДня(ДатаНачала);
	КонецИнтервала = НачалоДня(ДатаОкончания);

	Пока ТекущаяДатаГрафика <= КонецИнтервала Цикл
		Если СуществующиеДаты.Получить(ТекущаяДатаГрафика) = Неопределено Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ВКМ_Дата = ТекущаяДатаГрафика;
			Запись.ВКМ_Значение = ?(ДеньНедели(ТекущаяДатаГрафика) <= ВКМ_НомерПоследнегоРабочегоДняНедели(), 1, 0);
		КонецЕсли;
		ТекущаяДатаГрафика = ТекущаяДатаГрафика + ВКМ_СекундВСутках();
	КонецЦикла;

	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;

КонецПроцедуры

// Суммы процента от работ за месяц по списку сотрудников.
//
// Параметры:
//  Сотрудники - Массив - сотрудники, по которым нужны обороты.
//  ДатаПериода - Дата - любая дата месяца расчета.
//
// Возвращаемое значение:
//  Соответствие - ключ сотрудник, значение сумма к оплате за месяц.
//
Функция ВКМ_СуммыПроцентаОтРаботЗаМесяц(Сотрудники, ДатаПериода) Экспорт

	Результат = Новый Соответствие;
	Если Сотрудники.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выработка.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ЕСТЬNULL(СУММА(Выработка.ВКМ_СуммаКОплатеОборот), 0) КАК ВКМ_СуммаПоРаботам
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Период, ВКМ_Сотрудник В (&Сотрудники)) КАК Выработка
	|
	|СГРУППИРОВАТЬ ПО
	|	Выработка.ВКМ_Сотрудник";
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаПериода));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ВКМ_Сотрудник, Выборка.ВКМ_СуммаПоРаботам);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Рассчитывает записи основных начислений: оклад по ФПД и графику, отпуск по базе 12 месяцев.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ начисления зарплаты.
//
Процедура ВКМ_РассчитатьОсновныеНачисления(Регистратор) Экспорт

	ВКМ_ОбеспечитьГрафикПоРегистраторуОсновныхНачислений(Регистратор);

	Выборка = ВКМ_ВыборкаДанныхРасчетаОсновныхНачислений(Регистратор);
	ФактДнейПоСтрокам = ВКМ_ФактическиеДниПоГрафику(Регистратор);
	НормаДнейПоСтрокам = ВКМ_НормаДнейПоГрафику(Регистратор);

	НаборЗаписей = РегистрыРасчета.ВКМ_ОсновныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();

	Пока Выборка.Следующий() Цикл
		ВКМ_РассчитатьСтрокуОсновныхНачислений(НаборЗаписей, Выборка, ФактДнейПоСтрокам, НормаДнейПоСтрокам);
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

// База начислений (основные + дополнительные) по регистратору, в разрезе сотрудников.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ-регистратор начисления или премии.
//
// Возвращаемое значение:
//  Соответствие - ключ сотрудник, значение сумма начислений по регистратору.
//
Функция ВКМ_БазаНачисленийПоРегистратору(Регистратор) Экспорт

	Результат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.Сумма), 0) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		Основные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|		Основные.ВКМ_Результат КАК Сумма
	|	ИЗ
	|		РегистрРасчета.ВКМ_ОсновныеНачисления КАК Основные
	|	ГДЕ
	|		Основные.Регистратор = &Регистратор
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Дополнительные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|		Дополнительные.ВКМ_Результат КАК Сумма
	|	ИЗ
	|		РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Дополнительные
	|	ГДЕ
	|		Дополнительные.Регистратор = &Регистратор) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ВКМ_Сотрудник";
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ВКМ_Сотрудник, Выборка.Сумма);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Суммы взаиморасчётов (основные + дополнительные - удержания) по регистратору.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ-регистратор начисления или премии.
//
// Возвращаемое значение:
//  Соответствие - ключ сотрудник, значение сумма к выплате по регистратору.
//
Функция ВКМ_СуммыВзаиморасчетовПоРегистратору(Регистратор) Экспорт

	Результат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.Сумма), 0) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		Основные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|		Основные.ВКМ_Результат КАК Сумма
	|	ИЗ
	|		РегистрРасчета.ВКМ_ОсновныеНачисления КАК Основные
	|	ГДЕ
	|		Основные.Регистратор = &Регистратор
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Дополнительные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|		Дополнительные.ВКМ_Результат КАК Сумма
	|	ИЗ
	|		РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Дополнительные
	|	ГДЕ
	|		Дополнительные.Регистратор = &Регистратор
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Удержания.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|		-Удержания.ВКМ_Результат КАК Сумма
	|	ИЗ
	|		РегистрРасчета.ВКМ_Удержания КАК Удержания
	|	ГДЕ
	|		Удержания.Регистратор = &Регистратор) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ВКМ_Сотрудник";
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ВКМ_Сотрудник, Выборка.Сумма);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Заполняет табличную часть начисления зарплаты по условиям оплаты и плану отпусков.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - заполняемый документ начисления зарплаты.
//
Процедура ВКМ_ЗаполнитьНачисленияПоУсловиямОплаты(ДокументОбъект) Экспорт

	ДокументОбъект.ВКМ_Начисления.Очистить();

	ДатаДокумента = ?(ЗначениеЗаполнено(ДокументОбъект.Дата), ДокументОбъект.Дата, ТекущаяДатаСеанса());
	НачалоМесяцаДокумента = НачалоМесяца(ДатаДокумента);
	КонецМесяцаДокумента = КонецМесяца(ДатаДокумента);

	ВКМ_ОбеспечитьГрафикРаботы(НачалоМесяцаДокумента, КонецМесяцаДокумента);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УсловияОплаты.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	УсловияОплаты.ВКМ_ПроцентОтРабот КАК ВКМ_ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, ИСТИНА) КАК УсловияОплаты";
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаОклада = ДокументОбъект.ВКМ_Начисления.Добавить();
		СтрокаОклада.ВКМ_Сотрудник = Выборка.ВКМ_Сотрудник;
		СтрокаОклада.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад;
		СтрокаОклада.ВКМ_ДатаНачала = НачалоМесяцаДокумента;
		СтрокаОклада.ВКМ_ДатаОкончания = НачалоДня(КонецМесяцаДокумента);

		Если Выборка.ВКМ_ПроцентОтРабот <> Неопределено Тогда
			СтрокаПроцента = ДокументОбъект.ВКМ_Начисления.Добавить();
			СтрокаПроцента.ВКМ_Сотрудник = Выборка.ВКМ_Сотрудник;
			СтрокаПроцента.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ПроцентОтРабот;
			СтрокаПроцента.ВКМ_ДатаНачала = НачалоМесяцаДокумента;
			СтрокаПроцента.ВКМ_ДатаОкончания = НачалоДня(КонецМесяцаДокумента);
		КонецЕсли;
	КонецЦикла;

	ЗапросОтпусков = Новый Запрос;
	ЗапросОтпусков.Текст =
	"ВЫБРАТЬ
	|	ПланОтпусков.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ПланОтпусков.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
	|	ПланОтпусков.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания
	|ИЗ
	|	РегистрСведений.ВКМ_ПланОтпусковСотрудников КАК ПланОтпусков
	|ГДЕ
	|	ПланОтпусков.ВКМ_ДатаНачала <= &КонецМесяца
	|	И ПланОтпусков.ВКМ_ДатаОкончания >= &НачалоМесяца";
	ЗапросОтпусков.УстановитьПараметр("НачалоМесяца", НачалоМесяцаДокумента);
	ЗапросОтпусков.УстановитьПараметр("КонецМесяца", КонецМесяцаДокумента);

	ВыборкаОтпусков = ЗапросОтпусков.Выполнить().Выбрать();
	Пока ВыборкаОтпусков.Следующий() Цикл
		ДатаНачала = Макс(НачалоДня(ВыборкаОтпусков.ВКМ_ДатаНачала), НачалоМесяцаДокумента);
		ДатаОкончания = Мин(НачалоДня(ВыборкаОтпусков.ВКМ_ДатаОкончания), НачалоДня(КонецМесяцаДокумента));

		СтрокаОтпуска = ДокументОбъект.ВКМ_Начисления.Добавить();
		СтрокаОтпуска.ВКМ_Сотрудник = ВыборкаОтпусков.ВКМ_Сотрудник;
		СтрокаОтпуска.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск;
		СтрокаОтпуска.ВКМ_ДатаНачала = ДатаНачала;
		СтрокаОтпуска.ВКМ_ДатаОкончания = ДатаОкончания;
	КонецЦикла;

	ВКМ_ЗаполнитьСуммыНачисленийДокумента(ДокументОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ставка НДФЛ для расчёта удержания.
//
// Возвращаемое значение:
//  Число - доля налога от суммы начисления.
//
Функция ВКМ_СтавкаНДФЛ()

	СтавкаНДФЛ = 0.13;
	Возврат СтавкаНДФЛ;

КонецФункции

// Число знаков после запятой для денежных сумм.
//
// Возвращаемое значение:
//  Число - разрядность округления суммы.
//
Функция ВКМ_РазрядностьСуммы()

	РазрядностьСуммы = 2;
	Возврат РазрядностьСуммы;

КонецФункции

// Длина суток в секундах для расчёта календарных дней.
//
// Возвращаемое значение:
//  Число - количество секунд в сутках.
//
Функция ВКМ_СекундВСутках()

	СекундВСутках = 86400;
	Возврат СекундВСутках;

КонецФункции

// Номер последнего рабочего дня недели в графике пн-пт.
//
// Возвращаемое значение:
//  Число - номер дня недели по функции ДеньНедели.
//
Функция ВКМ_НомерПоследнегоРабочегоДняНедели()

	НомерПоследнегоРабочегоДняНедели = 5;
	Возврат НомерПоследнегоРабочегоДняНедели;

КонецФункции

// Число месяцев базы для расчёта отпускных.
//
// Возвращаемое значение:
//  Число - длительность базового периода отпуска в месяцах.
//
Функция ВКМ_МесяцевБазыОтпуска()

	МесяцевБазыОтпуска = 12;
	Возврат МесяцевБазыОтпуска;

КонецФункции

// Считает суммы строк документа начисления по тем же формулам, что при проведении.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - заполняемый документ начисления зарплаты.
//
Процедура ВКМ_ЗаполнитьСуммыНачисленийДокумента(ДокументОбъект)

	Если ДокументОбъект.ВКМ_Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДатаДокумента = ?(ЗначениеЗаполнено(ДокументОбъект.Дата), ДокументОбъект.Дата, ТекущаяДатаСеанса());
	НачалоБазы = ДобавитьМесяц(НачалоМесяца(ДатаДокумента), -ВКМ_МесяцевБазыОтпуска());
	КонецГрафика = КонецМесяца(ДатаДокумента);

	ВКМ_ОбеспечитьГрафикРаботы(НачалоБазы, КонецГрафика);

	Сотрудники = ВКМ_СотрудникиНачисленийДокумента(ДокументОбъект);
	ЗначенияГрафика = ВКМ_ЗначенияГрафикаПоДатам(НачалоБазы, КонецГрафика);
	Оклады = ВКМ_ОкладыСотрудников(Сотрудники, ДатаДокумента);
	СуммыПроцента = ВКМ_СуммыПроцентаОтРаботЗаМесяц(Сотрудники, ДатаДокумента);
	БазаОтпуска = ВКМ_ЗаписиБазыОтпуска(Сотрудники, НачалоБазы, НачалоМесяца(ДатаДокумента) - 1, ДокументОбъект.Ссылка);
	ИнтервалыОтпусков = ВКМ_ИнтервалыОтпусковДокумента(ДокументОбъект);

	Для Каждого СтрокаНачисления Из ДокументОбъект.ВКМ_Начисления Цикл
		СтрокаНачисления.ВКМ_СуммаНачисления = ВКМ_СуммаСтрокиНачисления(
			СтрокаНачисления, Оклады, СуммыПроцента, БазаОтпуска, ЗначенияГрафика, ИнтервалыОтпусков);
	КонецЦикла;

КонецПроцедуры

// Собирает уникальных сотрудников из табличной части начислений.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ начисления зарплаты.
//
// Возвращаемое значение:
//  Массив - сотрудники документа.
//
Функция ВКМ_СотрудникиНачисленийДокумента(ДокументОбъект)

	Сотрудники = Новый Массив;
	Для Каждого СтрокаНачисления Из ДокументОбъект.ВКМ_Начисления Цикл
		Если ЗначениеЗаполнено(СтрокаНачисления.ВКМ_Сотрудник)
			И Сотрудники.Найти(СтрокаНачисления.ВКМ_Сотрудник) = Неопределено Тогда
			Сотрудники.Добавить(СтрокаНачисления.ВКМ_Сотрудник);
		КонецЕсли;
	КонецЦикла;

	Возврат Сотрудники;

КонецФункции

// Оклады сотрудников на дату документа.
//
// Параметры:
//  Сотрудники - Массив - сотрудники документа.
//  ДатаДокумента - Дата - дата среза условий оплаты.
//
// Возвращаемое значение:
//  Соответствие - ключ сотрудник, значение оклад.
//
Функция ВКМ_ОкладыСотрудников(Сотрудники, ДатаДокумента)

	Результат = Новый Соответствие;
	Если Сотрудники.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УсловияОплаты.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	ЕСТЬNULL(УсловияОплаты.ВКМ_Оклад, 0) КАК ВКМ_Оклад
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, ВКМ_Сотрудник В (&Сотрудники)) КАК УсловияОплаты";
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ВКМ_Сотрудник, Выборка.ВКМ_Оклад);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Значения графика работы по датам интервала.
//
// Параметры:
//  ДатаНачала - Дата - начало интервала.
//  ДатаОкончания - Дата - конец интервала.
//
// Возвращаемое значение:
//  Соответствие - ключ дата, значение показатель графика.
//
Функция ВКМ_ЗначенияГрафикаПоДатам(ДатаНачала, ДатаОкончания)

	Результат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	График.ВКМ_Дата КАК ВКМ_Дата,
	|	График.ВКМ_Значение КАК ВКМ_Значение
	|ИЗ
	|	РегистрСведений.ВКМ_ГрафикиРаботы КАК График
	|ГДЕ
	|	График.ВКМ_Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(ДатаОкончания));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(НачалоДня(Выборка.ВКМ_Дата), Выборка.ВКМ_Значение);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Сумма показателей графика за календарный интервал.
//
// Параметры:
//  ЗначенияГрафика - Соответствие - значения графика по датам.
//  ДатаНачала - Дата - начало интервала.
//  ДатаОкончания - Дата - конец интервала.
//
// Возвращаемое значение:
//  Число - сумма значений графика.
//
Функция ВКМ_СуммаГрафикаЗаПериод(ЗначенияГрафика, ДатаНачала, ДатаОкончания)

	СуммаЗначений = 0;
	ТекущаяДатаГрафика = НачалоДня(ДатаНачала);
	КонецИнтервала = НачалоДня(ДатаОкончания);

	Пока ТекущаяДатаГрафика <= КонецИнтервала Цикл
		ЗначениеДня = ЗначенияГрафика.Получить(ТекущаяДатаГрафика);
		Если ЗначениеДня <> Неопределено Тогда
			СуммаЗначений = СуммаЗначений + ЗначениеДня;
		КонецЕсли;
		ТекущаяДатаГрафика = ТекущаяДатаГрафика + ВКМ_СекундВСутках();
	КонецЦикла;

	Возврат СуммаЗначений;

КонецФункции

// Проведённые начисления для базы отпуска.
//
// Параметры:
//  Сотрудники - Массив - сотрудники документа.
//  НачалоБазы - Дата - начало общего окна базы.
//  КонецБазы - Дата - конец общего окна базы.
//  Регистратор - ДокументСсылка - текущий документ, его движения не входят в базу.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки ВКМ_Сотрудник, ПериодРегистрации, Сумма.
//
Функция ВКМ_ЗаписиБазыОтпуска(Сотрудники, НачалоБазы, КонецБазы, Регистратор)

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВКМ_Сотрудник");
	Результат.Колонки.Добавить("ПериодРегистрации");
	Результат.Колонки.Добавить("Сумма");

	Если Сотрудники.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Основные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	Основные.ПериодРегистрации КАК ПериодРегистрации,
	|	Основные.ВКМ_Результат КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Основные
	|ГДЕ
	|	Основные.Активность
	|	И Основные.ВидРасчета <> &ВидОтпуск
	|	И Основные.ВКМ_Сотрудник В (&Сотрудники)
	|	И Основные.ПериодРегистрации >= &НачалоБазы
	|	И Основные.ПериодРегистрации <= &КонецБазы
	|	И Основные.Регистратор <> &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Дополнительные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	Дополнительные.ПериодРегистрации КАК ПериодРегистрации,
	|	Дополнительные.ВКМ_Результат КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Дополнительные
	|ГДЕ
	|	Дополнительные.Активность
	|	И Дополнительные.ВКМ_Сотрудник В (&Сотрудники)
	|	И Дополнительные.ПериодРегистрации >= &НачалоБазы
	|	И Дополнительные.ПериодРегистрации <= &КонецБазы
	|	И Дополнительные.Регистратор <> &Регистратор";
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("НачалоБазы", НачалоБазы);
	Запрос.УстановитьПараметр("КонецБазы", КонецБазы);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ВидОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Интервалы отпускных строк документа по сотрудникам.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - документ начисления зарплаты.
//
// Возвращаемое значение:
//  Соответствие - ключ сотрудник, значение массив интервалов.
//
Функция ВКМ_ИнтервалыОтпусковДокумента(ДокументОбъект)

	Результат = Новый Соответствие;
	ВидОтпуск = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск;

	Для Каждого СтрокаНачисления Из ДокументОбъект.ВКМ_Начисления Цикл
		Если СтрокаНачисления.ВКМ_ВидРасчета <> ВидОтпуск Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаНачисления.ВКМ_Сотрудник) Тогда
			Продолжить;
		КонецЕсли;

		Интервалы = Результат.Получить(СтрокаНачисления.ВКМ_Сотрудник);
		Если Интервалы = Неопределено Тогда
			Интервалы = Новый Массив;
			Результат.Вставить(СтрокаНачисления.ВКМ_Сотрудник, Интервалы);
		КонецЕсли;

		Интервалы.Добавить(Новый Структура("ДатаНачала, ДатаОкончания",
			НачалоДня(СтрокаНачисления.ВКМ_ДатаНачала), НачалоДня(СтрокаНачисления.ВКМ_ДатаОкончания)));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Сумма одной строки начисления документа.
//
// Параметры:
//  СтрокаНачисления - СтрокаТабличнойЧасти - строка ТЧ начислений.
//  Оклады - Соответствие - оклады по сотрудникам.
//  СуммыПроцента - Соответствие - суммы процента от работ.
//  БазаОтпуска - ТаблицаЗначений - проведённые начисления базы отпуска.
//  ЗначенияГрафика - Соответствие - значения графика по датам.
//  ИнтервалыОтпусков - Соответствие - отпуска документа по сотрудникам.
//
// Возвращаемое значение:
//  Число - сумма строки.
//
Функция ВКМ_СуммаСтрокиНачисления(СтрокаНачисления, Оклады, СуммыПроцента, БазаОтпуска, ЗначенияГрафика, ИнтервалыОтпусков)

	ВидОклад = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад;
	ВидОтпуск = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск;
	ВидПроцент = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ПроцентОтРабот;
	СуммаСтроки = 0;

	Если СтрокаНачисления.ВКМ_ВидРасчета = ВидОклад Тогда
		СуммаСтроки = ВКМ_СуммаСтрокиОклада(СтрокаНачисления, Оклады, ЗначенияГрафика, ИнтервалыОтпусков);
	ИначеЕсли СтрокаНачисления.ВКМ_ВидРасчета = ВидПроцент Тогда
		СуммаПроцента = СуммыПроцента.Получить(СтрокаНачисления.ВКМ_Сотрудник);
		СуммаСтроки = ?(СуммаПроцента = Неопределено, 0, СуммаПроцента);
	ИначеЕсли СтрокаНачисления.ВКМ_ВидРасчета = ВидОтпуск Тогда
		СуммаСтроки = ВКМ_СуммаСтрокиОтпускаДокумента(СтрокаНачисления, БазаОтпуска, ЗначенияГрафика);
	Иначе
		СуммаСтроки = 0;
	КонецЕсли;

	Возврат СуммаСтроки;

КонецФункции

// Оклад по факту и норме с вычетом дней отпуска в том же документе.
//
// Параметры:
//  СтрокаНачисления - СтрокаТабличнойЧасти - строка оклада.
//  Оклады - Соответствие - оклады по сотрудникам.
//  ЗначенияГрафика - Соответствие - значения графика по датам.
//  ИнтервалыОтпусков - Соответствие - отпуска документа по сотрудникам.
//
// Возвращаемое значение:
//  Число - сумма оклада.
//
Функция ВКМ_СуммаСтрокиОклада(СтрокаНачисления, Оклады, ЗначенияГрафика, ИнтервалыОтпусков)

	Оклад = Оклады.Получить(СтрокаНачисления.ВКМ_Сотрудник);
	Оклад = ?(Оклад = Неопределено, 0, Оклад);

	ДатаНачала = НачалоДня(СтрокаНачисления.ВКМ_ДатаНачала);
	ДатаОкончания = НачалоДня(СтрокаНачисления.ВКМ_ДатаОкончания);
	НормаДней = ВКМ_СуммаГрафикаЗаПериод(ЗначенияГрафика, НачалоМесяца(ДатаНачала), НачалоДня(КонецМесяца(ДатаНачала)));
	ФактДней = ВКМ_СуммаГрафикаЗаПериод(ЗначенияГрафика, ДатаНачала, ДатаОкончания);

	ОтпускаСотрудника = ИнтервалыОтпусков.Получить(СтрокаНачисления.ВКМ_Сотрудник);
	Если ОтпускаСотрудника <> Неопределено Тогда
		Для Каждого ИнтервалОтпуска Из ОтпускаСотрудника Цикл
			НачалоПересечения = Макс(ДатаНачала, ИнтервалОтпуска.ДатаНачала);
			КонецПересечения = Мин(ДатаОкончания, ИнтервалОтпуска.ДатаОкончания);
			Если НачалоПересечения <= КонецПересечения Тогда
				ФактДней = ФактДней - ВКМ_СуммаГрафикаЗаПериод(ЗначенияГрафика, НачалоПересечения, КонецПересечения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если НормаДней = 0 Или Оклад = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Окр(Оклад * ФактДней / НормаДней, ВКМ_РазрядностьСуммы());

КонецФункции

// Отпускные по базе 12 месяцев и календарным дням строки.
//
// Параметры:
//  СтрокаНачисления - СтрокаТабличнойЧасти - строка отпуска.
//  БазаОтпуска - ТаблицаЗначений - проведённые начисления базы отпуска.
//  ЗначенияГрафика - Соответствие - значения графика по датам.
//
// Возвращаемое значение:
//  Число - сумма отпускных.
//
Функция ВКМ_СуммаСтрокиОтпускаДокумента(СтрокаНачисления, БазаОтпуска, ЗначенияГрафика)

	ДатаНачала = НачалоДня(СтрокаНачисления.ВКМ_ДатаНачала);
	ДатаОкончания = НачалоДня(СтрокаНачисления.ВКМ_ДатаОкончания);
	НачалоБазы = ДобавитьМесяц(НачалоМесяца(ДатаНачала), -ВКМ_МесяцевБазыОтпуска());
	КонецБазы = НачалоМесяца(ДатаНачала) - 1;

	БазаСумма = 0;
	Для Каждого ЗаписьБазы Из БазаОтпуска Цикл
		Если ЗаписьБазы.ВКМ_Сотрудник = СтрокаНачисления.ВКМ_Сотрудник
			И ЗаписьБазы.ПериодРегистрации >= НачалоБазы
			И ЗаписьБазы.ПериодРегистрации <= КонецБазы Тогда
			БазаСумма = БазаСумма + ЗаписьБазы.Сумма;
		КонецЕсли;
	КонецЦикла;

	РабочихДней = ВКМ_СуммаГрафикаЗаПериод(ЗначенияГрафика, НачалоБазы, КонецБазы);
	КалендарныхДней = (ДатаОкончания - ДатаНачала) / ВКМ_СекундВСутках() + 1;

	Если РабочихДней = 0 Или КалендарныхДней <= 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Окр(БазаСумма / РабочихДней * КалендарныхДней, ВКМ_РазрядностьСуммы());

КонецФункции

// Находит запись набора по номеру строки регистратора.
//
// Параметры:
//  НаборЗаписей - РегистрРасчетаНаборЗаписей - прочитанный набор основных начислений.
//  НомерСтроки - Число - номер строки движения.
//
// Возвращаемое значение:
//  РегистрРасчетаЗапись - найденная запись или Неопределено.
//
Функция ВКМ_НайтиЗаписьНабораПоНомеруСтроки(НаборЗаписей, НомерСтроки)

	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.НомерСтроки = НомерСтроки Тогда
			Возврат Запись;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

// Суммирует фактические рабочие дни по графику для фрагментов ФПД регистратора.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ-регистратор основных начислений.
//
// Возвращаемое значение:
//  Соответствие - ключ номер строки, значение сумма дней графика по ФПД.
//
Функция ВКМ_ФактическиеДниПоГрафику(Регистратор)

	Результат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФПД.НомерСтроки КАК НомерСтроки,
	|	ФПД.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ФПД.ПериодДействияКонец КАК ПериодДействияКонец
	|ПОМЕСТИТЬ ВТ_ФПД
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ФактическийПериодДействия(Регистратор = &Регистратор) КАК ФПД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФПД.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(СУММА(График.ВКМ_Значение), 0) КАК ФактДней
	|ИЗ
	|	ВТ_ФПД КАК ФПД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ГрафикиРаботы КАК График
	|		ПО График.ВКМ_Дата >= НАЧАЛОПЕРИОДА(ФПД.ПериодДействияНачало, ДЕНЬ)
	|			И График.ВКМ_Дата <= НАЧАЛОПЕРИОДА(ФПД.ПериодДействияКонец, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ФПД.НомерСтроки";
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущееЗначение = Результат.Получить(Выборка.НомерСтроки);
		Если ТекущееЗначение = Неопределено Тогда
			ТекущееЗначение = 0;
		КонецЕсли;
		Результат.Вставить(Выборка.НомерСтроки, ТекущееЗначение + Выборка.ФактДней);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Заполняет график работы на интервал периодов регистратора основных начислений.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ-регистратор основных начислений.
//
Процедура ВКМ_ОбеспечитьГрафикПоРегистраторуОсновныхНачислений(Регистратор)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА Начисления.БазовыйПериодНачало = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Начисления.ПериодДействияНачало
	|			ИНАЧЕ Начисления.БазовыйПериодНачало
	|		КОНЕЦ) КАК ДатаНачала,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Начисления.БазовыйПериодКонец = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Начисления.ПериодДействияКонец
	|			ИНАЧЕ Начисления.БазовыйПериодКонец
	|		КОНЕЦ) КАК ДатаОкончания
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ДатаНачала) И ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
		ВКМ_ОбеспечитьГрафикРаботы(Выборка.ДатаНачала, Выборка.ДатаОкончания);
	КонецЕсли;

КонецПроцедуры

// Считает норму рабочих дней месяца периода действия по графику.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ-регистратор основных начислений.
//
// Возвращаемое значение:
//  Соответствие - ключ номер строки, значение норма рабочих дней месяца.
//
Функция ВКМ_НормаДнейПоГрафику(Регистратор)

	Результат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(СУММА(График.ВКМ_Значение), 0) КАК НормаДней
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ГрафикиРаботы КАК График
	|		ПО График.ВКМ_Дата >= НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало, МЕСЯЦ)
	|			И График.ВКМ_Дата <= НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Начисления.ПериодДействияНачало, МЕСЯЦ), ДЕНЬ)
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.НомерСтроки";
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.НомерСтроки, Выборка.НормаДней);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает выборку исходных данных для расчёта строк основных начислений.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ-регистратор основных начислений.
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - строки начислений с окладом, базой отпуска и рабочими днями.
//
Функция ВКМ_ВыборкаДанныхРасчетаОсновныхНачислений(Регистратор)

	Запрос = Новый Запрос;
	Запрос.Текст = ВКМ_ТекстЗапросаДанныхРасчетаОсновныхНачислений();
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ВидОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск);

	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

// Текст пакетного запроса данных расчёта основных начислений.
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ВКМ_ТекстЗапросаДанныхРасчетаОсновныхНачислений()

	Возврат
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	Начисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	Начисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	Начисления.Сторно КАК Сторно
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки,
	|	ВКМ_Сотрудник,
	|	ПериодДействияНачало,
	|	БазовыйПериодНачало,
	|	БазовыйПериодКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	МАКСИМУМ(УсловияОплаты.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодыУсловий
	|ИЗ
	|	ВТ_Начисления КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК УсловияОплаты
	|		ПО Начисления.ВКМ_Сотрудник = УсловияОплаты.ВКМ_Сотрудник
	|			И УсловияОплаты.Период <= Начисления.ПериодДействияНачало
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.НомерСтроки,
	|	Начисления.ВКМ_Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки,
	|	ВКМ_Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыУсловий.НомерСтроки КАК НомерСтроки,
	|	УсловияОплаты.ВКМ_Оклад КАК ВКМ_Оклад
	|ПОМЕСТИТЬ ВТ_УсловияОплаты
	|ИЗ
	|	ВТ_ПериодыУсловий КАК ПериодыУсловий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК УсловияОплаты
	|		ПО ПериодыУсловий.ВКМ_Сотрудник = УсловияОплаты.ВКМ_Сотрудник
	|			И ПериодыУсловий.Период = УсловияОплаты.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	Основные.ПериодРегистрации КАК ПериодРегистрации,
	|	Основные.ВКМ_Результат КАК Сумма
	|ПОМЕСТИТЬ ВТ_БазаЗаписей
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Основные
	|ГДЕ
	|	Основные.Активность
	|	И Основные.ВидРасчета <> &ВидОтпуск
	|	И Основные.ВКМ_Сотрудник В
	|			(ВЫБРАТЬ
	|				Начисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник
	|			ИЗ
	|				ВТ_Начисления КАК Начисления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Дополнительные.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	Дополнительные.ПериодРегистрации КАК ПериодРегистрации,
	|	Дополнительные.ВКМ_Результат КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Дополнительные
	|ГДЕ
	|	Дополнительные.Активность
	|	И Дополнительные.ВКМ_Сотрудник В
	|			(ВЫБРАТЬ
	|				Начисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник
	|			ИЗ
	|				ВТ_Начисления КАК Начисления)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВКМ_Сотрудник,
	|	ПериодРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(СУММА(БазаЗаписей.Сумма), 0) КАК БазаСумма
	|ПОМЕСТИТЬ ВТ_БазаПоСтрокам
	|ИЗ
	|	ВТ_Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БазаЗаписей КАК БазаЗаписей
	|		ПО Начисления.ВКМ_Сотрудник = БазаЗаписей.ВКМ_Сотрудник
	|			И БазаЗаписей.ПериодРегистрации >= Начисления.БазовыйПериодНачало
	|			И БазаЗаписей.ПериодРегистрации <= Начисления.БазовыйПериодКонец
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.НомерСтроки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(СУММА(График.ВКМ_Значение), 0) КАК РабочихДней
	|ПОМЕСТИТЬ ВТ_РабочиеДни
	|ИЗ
	|	ВТ_Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_ГрафикиРаботы КАК График
	|		ПО График.ВКМ_Дата >= НАЧАЛОПЕРИОДА(Начисления.БазовыйПериодНачало, ДЕНЬ)
	|			И График.ВКМ_Дата <= НАЧАЛОПЕРИОДА(Начисления.БазовыйПериодКонец, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.НомерСтроки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник,
	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	Начисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	Начисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	Начисления.Сторно КАК Сторно,
	|	ЕСТЬNULL(УсловияОплаты.ВКМ_Оклад, 0) КАК ВКМ_Оклад,
	|	ВЫБОР
	|		КОГДА УсловияОплаты.НомерСтроки ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьУсловияОплаты,
	|	ЕСТЬNULL(БазаПоСтрокам.БазаСумма, 0) КАК БазаСумма,
	|	ЕСТЬNULL(РабочиеДни.РабочихДней, 0) КАК РабочихДней
	|ИЗ
	|	ВТ_Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УсловияОплаты КАК УсловияОплаты
	|		ПО Начисления.НомерСтроки = УсловияОплаты.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БазаПоСтрокам КАК БазаПоСтрокам
	|		ПО Начисления.НомерСтроки = БазаПоСтрокам.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеДни КАК РабочиеДни
	|		ПО Начисления.НомерСтроки = РабочиеДни.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

КонецФункции

// Рассчитывает одну запись основных начислений по данным выборки.
//
// Параметры:
//  НаборЗаписей - РегистрРасчетаНаборЗаписей - прочитанный набор основных начислений.
//  Выборка - ВыборкаИзРезультатаЗапроса - строка данных расчета.
//  ФактДнейПоСтрокам - Соответствие - факт рабочих дней по номеру строки.
//  НормаДнейПоСтрокам - Соответствие - норма рабочих дней месяца по номеру строки.
//
Процедура ВКМ_РассчитатьСтрокуОсновныхНачислений(НаборЗаписей, Выборка, ФактДнейПоСтрокам, НормаДнейПоСтрокам)

	Запись = ВКМ_НайтиЗаписьНабораПоНомеруСтроки(НаборЗаписей, Выборка.НомерСтроки);
	Если Запись = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗнакСторно = ?(Выборка.Сторно, -1, 1);
	ВидОклад = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад;
	ВидОтпуск = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск;

	Если Выборка.ВидРасчета = ВидОклад Тогда
		ВКМ_РассчитатьСтрокуОклада(Запись, Выборка, ФактДнейПоСтрокам, НормаДнейПоСтрокам, ЗнакСторно);
	ИначеЕсли Выборка.ВидРасчета = ВидОтпуск Тогда
		ВКМ_РассчитатьСтрокуОтпуска(Запись, Выборка, ЗнакСторно);
	Иначе
		Запись.ВКМ_Результат = 0;
		Запись.ВКМ_ОтработаноДней = 0;
	КонецЕсли;

КонецПроцедуры

// Рассчитывает оклад по факту и норме рабочих дней.
//
// Параметры:
//  Запись - РегистрРасчетаЗапись - изменяемая запись набора.
//  Выборка - ВыборкаИзРезультатаЗапроса - строка данных расчета.
//  ФактДнейПоСтрокам - Соответствие - факт рабочих дней по номеру строки.
//  НормаДнейПоСтрокам - Соответствие - норма рабочих дней месяца по номеру строки.
//  ЗнакСторно - Число - 1 для обычной записи, -1 для сторно.
//
Процедура ВКМ_РассчитатьСтрокуОклада(Запись, Выборка, ФактДнейПоСтрокам, НормаДнейПоСтрокам, ЗнакСторно)

	НормаДней = НормаДнейПоСтрокам.Получить(Выборка.НомерСтроки);
	ФактДней = ФактДнейПоСтрокам.Получить(Выборка.НомерСтроки);
	НормаДней = ?(НормаДней = Неопределено, 0, НормаДней);
	ФактДней = ?(ФактДней = Неопределено, 0, ФактДней);

	Если НормаДней = 0 Или НЕ Выборка.ЕстьУсловияОплаты Тогда
		Запись.ВКМ_Результат = 0;
		Запись.ВКМ_ОтработаноДней = 0;
	Иначе
		Запись.ВКМ_Результат = Окр(Выборка.ВКМ_Оклад * ФактДней / НормаДней, ВКМ_РазрядностьСуммы()) * ЗнакСторно;
		Запись.ВКМ_ОтработаноДней = ФактДней * ЗнакСторно;
	КонецЕсли;

КонецПроцедуры

// Рассчитывает отпуск по базе начислений и календарным дням периода действия.
//
// Параметры:
//  Запись - РегистрРасчетаЗапись - изменяемая запись набора.
//  Выборка - ВыборкаИзРезультатаЗапроса - строка данных расчета.
//  ЗнакСторно - Число - 1 для обычной записи, -1 для сторно.
//
Процедура ВКМ_РассчитатьСтрокуОтпуска(Запись, Выборка, ЗнакСторно)

	КалендарныхДней = (НачалоДня(Выборка.ПериодДействияКонец) - НачалоДня(Выборка.ПериодДействияНачало))
		/ ВКМ_СекундВСутках() + 1;
	Если Выборка.РабочихДней = 0 Или КалендарныхДней <= 0 Тогда
		Запись.ВКМ_Результат = 0;
	Иначе
		Запись.ВКМ_Результат = Окр(Выборка.БазаСумма / Выборка.РабочихДней * КалендарныхДней, ВКМ_РазрядностьСуммы())
			* ЗнакСторно;
	КонецЕсли;
	Запись.ВКМ_ОтработаноДней = 0;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
